In [12]:
import pandas as pd
import sqlalchemy
from urllib.parse import quote_plus

In [16]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:%s@localhost:13306/application" % quote_plus("mysql@123"))
print(quote_plus("mysql@123"))

mysql%40123

In [17]:
df = pd.read_sql_table('Customers', engine)
df

   id    name phone_number
0   1  Donald   7326784567
1   2    Bill   6573489999
2   3   Obama   4567896654

In [19]:
query = '''
SELECT Customers.name, Customers.phone_number, Orders.name, Orders.amount
FROM Customers inner join Orders
on Customers.id = Orders.customer_id;
'''
df = pd.read_sql_query(query, engine)
df

     name phone_number          name  amount
0    Bill   6573489999      Yoga Mat      20
1  Donald   7326784567  Google Pixel     950
2   Obama   4567896654  Fossil Watch     120

In [21]:
df = pd.read_csv('data/customers.csv')
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [24]:
df.rename(
    columns={
        'Customer Name':'name',
        'Customer Phone':'phone_number'
    }, inplace=True)

In [25]:
df

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [26]:
df.to_sql(
    name='Customers',
    con=engine,
    index=False,
    if_exists='append'
)

6